/* App */
"app.title" = "腳本助手 (Alpha)";

/* Settings Sheet */
"settings.title" = "AI 服務設定";
"settings.apiKeyLabel" = "API 金鑰：";
"settings.endpointLabel" = "端點 URL：";
"settings.endpointPlaceholder" = "https://api.example.com/v1";
"settings.testConnection" = "測試連線";
"settings.modelLabel" = "模型：";
"settings.cancel" = "取消";
"settings.save" = "儲存";
"settings.show" = "顯示";
"settings.hide" = "隱藏";

/* Detection */
"detection.detected" = "✓ 偵測到：%@";
"detection.unknown" = "？未知的輸入格式";
"detection.fetching" = "✓ 偵測到：%@ — 正在擷取模型…";
"detection.modelsFound" = "✓ 偵測到：%@ — 找到 %lu 個模型";

/* Chat */
"chat.inputPlaceholder" = "輸入訊息…";
"chat.notConfigured" = "請先設定 AI 服務。";
"chat.feedbackSent" = "[已將執行結果傳送給 AI]";

/* Mode Toggle */
"mode.chat" = "對話";
"mode.console" = "主控台";
"mode.window" = "視窗";
"mode.autoFixProgress" = "[自動修正 %lu/%lu]";

/* Tool Use */
"tool.executing" = "[執行工具：%@]";
"tool.codePanelUpdated" = "已更新程式碼面板";
"tool.unknownTool" = "未知工具";
"tool.result" = "結果";
"tool.chatModeBlocked" = "Chat 模式下不允許此操作（唯讀）";

/* Context Stats Bar */
"stats.tokens" = "%1$@ %2$@ / %3$@";
"stats.tokens.noLimit" = "%@ tokens";
"stats.autoFix" = "修復 %lu/%lu";

/* Provider Display Names */
"provider.anthropic" = "Anthropic";
"provider.openai" = "OpenAI";
"provider.grok" = "Grok";
"provider.gemini" = "Gemini";
"provider.ollama" = "Ollama";
"provider.lmStudio" = "LM Studio";
"provider.jan" = "Jan";
"provider.openaiCompatible" = "OpenAI 相容端點";
"provider.customEndpoint" = "自訂端點";
"provider.aiService" = "AI 服務";
"provider.unknown" = "未知";

/* Export */
"export.success" = "已匯出至：%@";
"export.fileExists.title" = "檔案已存在";
"export.fileExists.message" = "「%@」已存在，要取代它嗎？";
"export.fileExists.replace" = "取代";
"export.fileExists.cancel" = "取消";
"export.menuTitleRequired.title" = "需要選單標題";
"export.menuTitleRequired.message" = "請在腳本開頭加入 # MenuTitle: 行。";
"export.error.title" = "匯出失敗";
"export.error.message" = "無法匯出腳本：%@";

/* Import */
"import.error.title" = "匯入失敗";
"import.error.readFailed" = "無法讀取檔案：%@";
"import.success" = "已匯入：%@";

/* Settings — Scripts Path */
"settings.scriptsPathLabel" = "腳本資料夾：";
"settings.scriptsPathDefault" = "預設（…/Glyphs 3/Scripts/ScriptMate/）";
"settings.scriptsPathBrowse" = "瀏覽⋯";
"settings.scriptsPathReset" = "重設為預設";

/* Settings Window */
"settings.tab.general" = "一般";
"settings.tab.aiService" = "AI 服務";
"settings.general.scriptsFolder" = "腳本資料夾：";
"settings.general.browse" = "瀏覽⋯";
"settings.general.resetDefault" = "重設為預設";
"settings.general.defaultPath" = "預設（…/Glyphs 3/Scripts/ScriptMate/）";
"settings.general.choose" = "選擇";
"settings.general.language" = "對話語言：";
"settings.general.webSearch" = "論壇搜尋（Glyphs 論壇）";
"settings.general.maxToolIterations" = "最大自動修正次數：";
"settings.general.maxToolIterations.manual" = "僅寫碼";
"settings.general.promptTier" = "提示詞最佳化：";
"settings.general.promptTier.auto" = "自動（建議）";
"settings.general.promptTier.full" = "完整 — 大型模型";
"settings.general.promptTier.standard" = "標準 — 中型模型";
"settings.general.promptTier.compact" = "精簡 — 小型本地模型";
"settings.general.promptTier.hint" = "自動偵測模型能力。若 AI 跳過步驟或回答不完整，可手動選擇。";
"settings.general.environment" = "環境";
"settings.general.install" = "安裝";
"settings.general.installed" = "已安裝";
"settings.openSettings" = "設定⋯";

/* Service List Context Menu */
"settings.service.edit" = "編輯⋯";
"settings.service.delete" = "刪除";

/* Service Editor */
"settings.editor.title" = "新增 AI 服務";
"settings.editor.type" = "類型：";
"settings.editor.add" = "新增";
"settings.editor.testing" = "正在測試連線⋯";
"settings.editor.connectionFailed" = "連線失敗";
"settings.editor.save" = "儲存";
"settings.editor.editTitle" = "編輯服務";

/* ACP Backend */
"settings.backendTypeLabel" = "後端：";
"settings.backendType.api" = "API";
"settings.backendType.acp" = "ACP Agent";
"settings.agentLabel" = "Agent：";
"settings.agentName.default" = "ACP Agent";
"settings.noAgentsFound" = "未偵測到 ACP Agent";

/* ACP Toggle */
"settings.acpToggle" = "顯示已安裝的 ACP 代理程式";

/* Provider / Agent Popup */
"settings.providerLabel" = "供應商：";
"settings.apiKeyOptional" = "選填";
"settings.customAgent" = "自訂⋯";
"settings.customAgentLabel" = "指令：";

/* Bottom Toolbar */
"toolbar.run" = "執行";
"toolbar.export" = "匯出";
"toolbar.import" = "匯入";

/* Tab Bar */
"tab.new" = "新分頁";
"tab.history" = "歷史紀錄";
"tab.close" = "關閉分頁";
"tab.closeOthers" = "關閉其他分頁";
"tab.delete" = "刪除對話";
"tab.recentConversations" = "最近的對話";
"tab.noHistory" = "尚無對話紀錄";
"tab.untitled" = "未命名";

/* Chat UI Status */
"status.responding" = "回應中…";
"status.executingTool" = "執行 %@…";
"status.cancelled" = "回應已取消。";
"status.noResponse" = "未收到回應。";

/* Chat Input */
"input.placeholder" = "輸入訊息…";
"input.aiDisclaimer" = "AI 產生的腳本可能包含錯誤，執行前請自行確認。";

/* Toolbar Tooltips */
"toolbar.settings" = "設定";
"toolbar.webSearch.on" = "論壇搜尋：開啟";
"toolbar.webSearch.off" = "論壇搜尋：關閉";
"toolbar.autoFix.on" = "自動修正：開啟";
"toolbar.autoFix.off" = "自動修正：關閉";

/* Edit Code */
"edit_code.invalidParameterType" = "參數無效：start_line 和 end_line 必須為數字";
"edit_code.emptyCode" = "code 參數為空：必須提供替換的程式碼內容";

/* Mode Pill */
"mode.chat.pill" = "對話";
"mode.console.pill" = "主控台";
"mode.window.pill" = "視窗";
